Documents/ПриходПоИнвентаризации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПриходПоИнвентаризации</Name>
			<BasedOn>
				<xr:Item>Document.Инвентаризация</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Итого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПриходНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураСПР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходПоИнвентаризации/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриходНоменклатураКоличествоПриИзменении(Элемент)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ); 
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ПриходНоменклатураЦенаПриИзменении(Элемент)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные; 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);    
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
КонецПроцедуры     

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;
	Для Каждого СТЧ Из Объект.ПриходНоменклатура Цикл    
		РасчетСуммыВДокументе.РасчетСуммы(СТЧ);  
		СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.НоменклатураСПР);
	КонецЦикла
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;
	Объект.Итого = Объект.ПриходНоменклатура.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьЦены(Команда)
	СТЧ = Элементы.ПриходНоменклатура.ТекущиеДанные;   
	СТЧ.Цена = ПодгрузкаЦен.ПодстановкаЦены(Объект.Дата, СТЧ.Номенклатура); 
	РасчетСуммыВДокументе.РасчетСуммы(СТЧ);
КонецПроцедуры
